pyocd/pyOCD/pyocd/debug/svd/data/HC32K118.svd
                <register>
                    <name>AWD0DR0</name>
                    <description>desc AWD0DR0</description>
                    <addressOffset>0xA4</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                </register>
                <register>
                    <name>AWD0DR1</name>
                    <description>desc AWD0DR1</description>
                    <addressOffset>0xA6</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0xFFFF</resetValue>
                    <resetMask>0xFFFF</resetMask>
                </register>
                <register>
                    <name>AWD0CHSR</name>
                    <description>desc AWD0CHSR</description>
                    <addressOffset>0xA8</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1F</resetMask>
                    <fields>
                        <field>
                            <name>AWDCH</name>
                            <description>desc AWDCH</description>
                            <msb>4</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>AWD1DR0</name>
                    <description>desc AWD1DR0</description>
                    <addressOffset>0xAC</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                </register>
                <register>
                    <name>AWD1DR1</name>
                    <description>desc AWD1DR1</description>
                    <addressOffset>0xAE</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0xFFFF</resetValue>
                    <resetMask>0xFFFF</resetMask>
                </register>
                <register>
                    <name>AWD1CHSR</name>
                    <description>desc AWD1CHSR</description>
                    <addressOffset>0xB0</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1F</resetMask>
                    <fields>
                        <field>
                            <name>AWDCH</name>
                            <description>desc AWDCH</description>
                            <msb>4</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
            </registers>
        </peripheral>
        <peripheral>
            <name>AOS</name>
            <description>desc AOS</description>
            <baseAddress>0x40000C00</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x174</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>INTSFTTRG</name>
                    <description>desc INTSFTTRG</description>
                    <addressOffset>0x0</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1</resetMask>
                    <fields>
                        <field>
                            <name>STRG</name>
                            <description>desc STRG</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TMR0_TRGSEL</name>
                    <description>desc TMR0_TRGSEL</description>
                    <addressOffset>0x4</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x7F</resetValue>
                    <resetMask>0xC000007F</resetMask>
                    <fields>
                        <field>
                            <name>TRGSEL</name>
                            <description>desc TRGSEL</description>
                            <msb>6</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>COMEN</name>
                            <description>desc COMEN</description>
                            <msb>31</msb>
                            <lsb>30</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TMR2_TRGSEL0</name>
                    <description>desc TMR2_TRGSEL0</description>
                    <addressOffset>0x8</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x7F</resetValue>
                    <resetMask>0xC000007F</resetMask>
                    <fields>
                        <field>
                            <name>TRGSEL</name>
                            <description>desc TRGSEL</description>
                            <msb>6</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>COMEN</name>
                            <description>desc COMEN</description>
                            <msb>31</msb>
                            <lsb>30</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TMR2_TRGSEL1</name>
                    <description>desc TMR2_TRGSEL1</description>
                    <addressOffset>0xC</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x7F</resetValue>
                    <resetMask>0xC000007F</resetMask>
                    <fields>
                        <field>
                            <name>TRGSEL</name>
                            <description>desc TRGSEL</description>
                            <msb>6</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>COMEN</name>
                            <description>desc COMEN</description>
                            <msb>31</msb>
                            <lsb>30</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TMR4_TRGSEL</name>
                    <description>desc TMR4_TRGSEL</description>
                    <addressOffset>0x10</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x7F</resetValue>
                    <resetMask>0xC000007F</resetMask>
                    <fields>
                        <field>
                            <name>TRGSEL</name>
                            <description>desc TRGSEL</description>
                            <msb>6</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>COMEN</name>
                            <description>desc COMEN</description>
                            <msb>31</msb>
                            <lsb>30</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TMRA_TRGSEL0</name>
                    <description>desc TMRA_TRGSEL0</description>
                    <addressOffset>0x14</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x7F</resetValue>
                    <resetMask>0xC000007F</resetMask>
                    <fields>
                        <field>
                            <name>TRGSEL</name>
                            <description>desc TRGSEL</description>
                            <msb>6</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>COMEN</name>
                            <description>desc COMEN</description>
                            <msb>31</msb>
                            <lsb>30</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TMRA_TRGSEL1</name>
                    <description>desc TMRA_TRGSEL1</description>
                    <addressOffset>0x18</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x7F</resetValue>
                    <resetMask>0xC000007F</resetMask>
                    <fields>
                        <field>
                            <name>TRGSEL</name>
                            <description>desc TRGSEL</description>
                            <msb>6</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>COMEN</name>
                            <description>desc COMEN</description>
                            <msb>31</msb>
                            <lsb>30</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ADC_TRGSEL0</name>
                    <description>desc ADC_TRGSEL0</description>
                    <addressOffset>0x1C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x7F</resetValue>
                    <resetMask>0xC000007F</resetMask>
                    <fields>
                        <field>
                            <name>TRGSEL</name>
                            <description>desc TRGSEL</description>
                            <msb>6</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>COMEN</name>
                            <description>desc COMEN</description>
                            <msb>31</msb>
                            <lsb>30</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ADC_TRGSEL1</name>
                    <description>desc ADC_TRGSEL1</description>
                    <addressOffset>0x20</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x7F</resetValue>
                    <resetMask>0xC000007F</resetMask>
                    <fields>
                        <field>
                            <name>TRGSEL</name>
                            <description>desc TRGSEL</description>
                            <msb>6</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>COMEN</name>
                            <description>desc COMEN</description>
                            <msb>31</msb>
                            <lsb>30</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DMA_TRGSEL0</name>
                    <description>desc DMA_TRGSEL0</description>
                    <addressOffset>0x24</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x7F</resetValue>
                    <resetMask>0xC000007F</resetMask>
                    <fields>
                        <field>
                            <name>TRGSEL</name>
                            <description>desc TRGSEL</description>
                            <msb>6</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>COMEN</name>
                            <description>desc COMEN</description>
                            <msb>31</msb>
                            <lsb>30</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DMA_TRGSEL1</name>
                    <description>desc DMA_TRGSEL1</description>
                    <addressOffset>0x28</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x7F</resetValue>
                    <resetMask>0xC000007F</resetMask>
                    <fields>
                        <field>
                            <name>TRGSEL</name>
                            <description>desc TRGSEL</description>
                            <msb>6</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>COMEN</name>
                            <description>desc COMEN</description>
                            <msb>31</msb>
                            <lsb>30</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DMA_TRGSEL2</name>
                    <description>desc DMA_TRGSEL2</description>
                    <addressOffset>0x2C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x7F</resetValue>
                    <resetMask>0xC000007F</resetMask>
                    <fields>
                        <field>
                            <name>TRGSEL</name>
                            <description>desc TRGSEL</description>
                            <msb>6</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>COMEN</name>
                            <description>desc COMEN</description>
                            <msb>31</msb>
                            <lsb>30</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DMA_TRGSEL3</name>
                    <description>desc DMA_TRGSEL3</description>
                    <addressOffset>0x30</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x7F</resetValue>
                    <resetMask>0xC000007F</resetMask>
                    <fields>
                        <field>
                            <name>TRGSEL</name>
                            <description>desc TRGSEL</description>
                            <msb>6</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>COMEN</name>
                            <description>desc COMEN</description>
                            <msb>31</msb>
                            <lsb>30</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PEVNT_TRGSEL12</name>
                    <description>desc PEVNT_TRGSEL12</description>
                    <addressOffset>0x34</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x7F</resetValue>
                    <resetMask>0xC000007F</resetMask>
                    <fields>
                        <field>
                            <name>TRGSEL</name>
                            <description>desc TRGSEL</description>
                            <msb>6</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>COMEN</name>
                            <description>desc COMEN</description>
                            <msb>31</msb>
                            <lsb>30</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PEVNT_TRGSEL34</name>
                    <description>desc PEVNT_TRGSEL34</description>
                    <addressOffset>0x38</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x7F</resetValue>
                    <resetMask>0xC000007F</resetMask>
                    <fields>
                        <field>
                            <name>TRGSEL</name>
                            <description>desc TRGSEL</description>
                            <msb>6</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>COMEN</name>
                            <description>desc COMEN</description>
                            <msb>31</msb>
                            <lsb>30</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>COMTRGSEL1</name>
                    <description>desc COMTRGSEL1</description>
                    <addressOffset>0x3C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x7F</resetValue>
                    <resetMask>0xC000007F</resetMask>
                    <fields>
                        <field>
                            <name>TRGSEL</name>
                            <description>desc TRGSEL</description>
                            <msb>6</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>COMEN</name>
                            <description>desc COMEN</description>
                            <msb>31</msb>
                            <lsb>30</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>COMTRGSEL2</name>
                    <description>desc COMTRGSEL2</description>
                    <addressOffset>0x40</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x7F</resetValue>
                    <resetMask>0xC000007F</resetMask>
                    <fields>
                        <field>
                            <name>TRGSEL</name>
                            <description>desc TRGSEL</description>
                            <msb>6</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>COMEN</name>
                            <description>desc COMEN</description>
                            <msb>31</msb>
                            <lsb>30</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PEVNTDIRR1</name>
                    <description>desc PEVNTDIRR1</description>
                    <addressOffset>0x100</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>PDIR</name>
                            <description>desc PDIR</description>
                            <msb>15</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PEVNTIDR1</name>
                    <description>desc PEVNTIDR1</description>
                    <addressOffset>0x104</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>PIN</name>
                            <description>desc PIN</description>
                            <msb>15</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
