pyocd/pyOCD/pyocd/debug/svd/data/HC32K118.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>EFM</name>
            <description>desc EFM</description>
            <baseAddress>0x40000400</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x687</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>EFM</name>
                <description>EFM Interrupt</description>
                <value>5</value>
            </interrupt>
            <registers>
                <register>
                    <name>DFAPRT</name>
                    <description>desc DFAPRT</description>
                    <addressOffset>0x0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>FAPRT</name>
                            <description>desc FAPRT</description>
                            <msb>15</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DKEY1</name>
                    <description>desc DKEY1</description>
                    <addressOffset>0x4</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <register>
                    <name>DKEY2</name>
                    <description>desc DKEY2</description>
                    <addressOffset>0x8</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <register>
                    <name>DFSTP</name>
                    <description>desc DFSTP</description>
                    <addressOffset>0x14</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1</resetMask>
                    <fields>
                        <field>
                            <name>FSTP</name>
                            <description>desc FSTP</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DFRMC</name>
                    <description>desc DFRMC</description>
                    <addressOffset>0x18</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x3</resetValue>
                    <resetMask>0xF0F</resetMask>
                    <fields>
                        <field>
                            <name>FLWT</name>
                            <description>desc FLWT</description>
                            <msb>3</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>M0RD</name>
                            <description>desc M0RD</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>M1RD</name>
                            <description>desc M1RD</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BLKDE</name>
                            <description>desc BLKDE</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EIRD</name>
                            <description>desc EIRD</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DFWMC</name>
                    <description>desc DFWMC</description>
                    <addressOffset>0x1C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x30000</resetValue>
                    <resetMask>0x30717</resetMask>
                    <fields>
                        <field>
                            <name>PEMOD</name>
                            <description>desc PEMOD</description>
                            <msb>2</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ERCALE</name>
                            <description>desc ERCALE</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BUSHLDCTL</name>
                            <description>desc BUSHLDCTL</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BLKECCWSEL</name>
                            <description>desc BLKECCWSEL</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BLKECCRSEL</name>
                            <description>desc BLKECCRSEL</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>KEY1LOCK</name>
                            <description>desc KEY1LOCK</description>
                            <msb>16</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>KEY2LOCK</name>
                            <description>desc KEY2LOCK</description>
                            <msb>17</msb>
                            <lsb>17</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DFSR</name>
                    <description>desc DFSR</description>
                    <addressOffset>0x20</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x100</resetValue>
                    <resetMask>0x1D7F</resetMask>
                    <fields>
                        <field>
                            <name>OTPWERR</name>
                            <description>desc OTPWERR</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PRTWERR</name>
                            <description>desc PRTWERR</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PGSZERR</name>
                            <description>desc PGSZERR</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>MISMTCH</name>
                            <description>desc MISMTCH</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>OPTEND</name>
                            <description>desc OPTEND</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>COLERR</name>
                            <description>desc COLERR</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ERCAL</name>
                            <description>desc ERCAL</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RDY</name>
                            <description>desc RDY</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ECC1ERR</name>
                            <description>desc ECC1ERR</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ECC2ERR</name>
                            <description>desc ECC2ERR</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>BLKERR</name>
                            <description>desc BLKERR</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DFSCLR</name>
                    <description>desc DFSCLR</description>
                    <addressOffset>0x24</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1C7F</resetMask>
                    <fields>
                        <field>
                            <name>OTPWERRCLR</name>
                            <description>desc OTPWERRCLR</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PRTWERRCLR</name>
                            <description>desc PRTWERRCLR</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PGSZERRCLR</name>
                            <description>desc PGSZERRCLR</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MISMTCHCLR</name>
                            <description>desc MISMTCHCLR</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OPTENDCLR</name>
                            <description>desc OPTENDCLR</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>COLERRCLR</name>
                            <description>desc COLERRCLR</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ERCALCLR</name>
                            <description>desc ERCALCLR</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ECC1ERRCLR</name>
                            <description>desc ECC1ERRCLR</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ECC2ERRCLR</name>
                            <description>desc ECC2ERRCLR</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BLKERRCLR</name>
                            <description>desc BLKERRCLR</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DFITE</name>
                    <description>desc DFITE</description>
                    <addressOffset>0x28</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xF</resetMask>
                    <fields>
                        <field>
                            <name>PEERRITE</name>
                            <description>desc PEERRITE</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OPTENDITE</name>
                            <description>desc OPTENDITE</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>COLERRITE</name>
                            <description>desc COLERRITE</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BLKERRITE</name>
                            <description>desc BLKERRITE</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DFEC</name>
                    <description>desc DFEC</description>
                    <addressOffset>0xB0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x6</resetValue>
                    <resetMask>0x7</resetMask>
                    <fields>
                        <field>
                            <name>ECCOAD</name>
                            <description>desc ECCOAD</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ECCMOD</name>
                            <description>desc ECCMOD</description>
                            <msb>2</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DFECERA</name>
                    <description>desc DFECERA</description>
                    <addressOffset>0xB4</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x40000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <register>
                    <name>DERI0</name>
                    <description>desc DERI0</description>
                    <addressOffset>0xB8</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <register>
                    <name>DERI2</name>
                    <description>desc DERI2</description>
                    <addressOffset>0xC0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x7F</resetMask>
                    <fields>
                        <field>
                            <name>ERI2</name>
                            <description>desc ERI2</description>
                            <msb>6</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
