pyocd/pyOCD/pyocd/debug/svd/data/HC32K118.svd
                <register>
                    <name>ICGB1HHA</name>
                    <description>desc ICGB1HHA</description>
                    <addressOffset>0x1C</addressOffset>
                    <size>8</size>
                    <access>read-only</access>
                    <resetValue>0xFF</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>ENWPRT24</name>
                            <description>desc ENWPRT24</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ENWPRT25</name>
                            <description>desc ENWPRT25</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ENWPRT26</name>
                            <description>desc ENWPRT26</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ENWPRT27</name>
                            <description>desc ENWPRT27</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ENWPRT28</name>
                            <description>desc ENWPRT28</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ENWPRT29</name>
                            <description>desc ENWPRT29</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ENWPRT30</name>
                            <description>desc ENWPRT30</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ENWPRT31</name>
                            <description>desc ENWPRT31</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ICGB1HHB</name>
                    <description>desc ICGB1HHB</description>
                    <addressOffset>0x1D</addressOffset>
                    <size>8</size>
                    <access>read-only</access>
                    <resetValue>0xFF</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>ENWPRT24</name>
                            <description>desc ENWPRT24</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ENWPRT25</name>
                            <description>desc ENWPRT25</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ENWPRT26</name>
                            <description>desc ENWPRT26</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ENWPRT27</name>
                            <description>desc ENWPRT27</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ENWPRT28</name>
                            <description>desc ENWPRT28</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ENWPRT29</name>
                            <description>desc ENWPRT29</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ENWPRT30</name>
                            <description>desc ENWPRT30</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ENWPRT31</name>
                            <description>desc ENWPRT31</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ICGB1HHC</name>
                    <description>desc ICGB1HHC</description>
                    <addressOffset>0x1E</addressOffset>
                    <size>8</size>
                    <access>read-only</access>
                    <resetValue>0xFF</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>ENWPRT24</name>
                            <description>desc ENWPRT24</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ENWPRT25</name>
                            <description>desc ENWPRT25</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ENWPRT26</name>
                            <description>desc ENWPRT26</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ENWPRT27</name>
                            <description>desc ENWPRT27</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ENWPRT28</name>
                            <description>desc ENWPRT28</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ENWPRT29</name>
                            <description>desc ENWPRT29</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ENWPRT30</name>
                            <description>desc ENWPRT30</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ENWPRT31</name>
                            <description>desc ENWPRT31</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
