pyocd/pyOCD/pyocd/debug/svd/data/HC32K118.svd
            </registers>
        </peripheral>
        <peripheral derivedFrom="SPI1">
            <name>SPI2</name>
            <description>desc SPI</description>
            <baseAddress>0x40003C00</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x1C</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>SPI2_RXFULL_TXEMPTY</name>
                <description>SPI unit 2 receive full or transmit buffer empty interrupt</description>
                <value>21</value>
            </interrupt>
            <interrupt>
                <name>SPI2_IDLE_ERROR</name>
                <description>SPI unit 2 idle or error interrupt</description>
                <value>22</value>
            </interrupt>
        </peripheral>
        <peripheral>
            <name>SRAMC</name>
            <description>desc SRAMC</description>
            <baseAddress>0x40010C00</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x24</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>CKCR</name>
                    <description>desc CKCR</description>
                    <addressOffset>0x8</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xC02</resetMask>
                    <fields>
                        <field>
                            <name>SRAM1_ECCOAD</name>
                            <description>desc SRAM1_ECCOAD</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SRAM1_ECCMOD</name>
                            <description>desc SRAM1_ECCMOD</description>
                            <msb>11</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CKPR</name>
                    <description>desc CKPR</description>
                    <addressOffset>0xC</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>CKPRC</name>
                            <description>desc CKPRC</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CKPRKW</name>
                            <description>desc CKPRKW</description>
                            <msb>7</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CKSR</name>
                    <description>desc CKSR</description>
                    <addressOffset>0x10</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xC</resetMask>
                    <fields>
                        <field>
                            <name>SRAM1_1ERR</name>
                            <description>desc SRAM1_1ERR</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SRAM1_2ERR</name>
                            <description>desc SRAM1_2ERR</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SRAM1_EIEN</name>
                    <description>desc SRAM1_EIEN</description>
                    <addressOffset>0x14</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1</resetMask>
                    <fields>
                        <field>
                            <name>EIEN</name>
                            <description>desc EIEN</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SRAM1_EIBIT0</name>
                    <description>desc SRAM1_EIBIT0</description>
                    <addressOffset>0x18</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <register>
                    <name>SRAM1_EIBIT1</name>
                    <description>desc SRAM1_EIBIT1</description>
                    <addressOffset>0x1C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x7F</resetMask>
                    <fields>
                        <field>
                            <name>EIBIT</name>
                            <description>desc EIBIT</description>
                            <msb>6</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SRAM1_ECCERRADDR</name>
                    <description>desc SRAM1_ECCERRADDR</description>
                    <addressOffset>0x20</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1FFFF</resetMask>
                    <fields>
                        <field>
                            <name>ECCERRADDR</name>
                            <description>desc ECCERRADDR</description>
                            <msb>16</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
