pyocd/pyOCD/pyocd/debug/svd/data/HC32K118.svd
                <register>
                    <name>CCONR2</name>
                    <description>desc CCONR2</description>
                    <addressOffset>0x104</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x7F71</resetMask>
                    <fields>
                        <field>
                            <name>CAPMD</name>
                            <description>desc CAPMD</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HICP0</name>
                            <description>desc HICP0</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HICP1</name>
                            <description>desc HICP1</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HICP2</name>
                            <description>desc HICP2</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HICP3</name>
                            <description>desc HICP3</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HICP4</name>
                            <description>desc HICP4</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HICP5</name>
                            <description>desc HICP5</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HICP6</name>
                            <description>desc HICP6</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NOFIENCP</name>
                            <description>desc NOFIENCP</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NOFICKCP</name>
                            <description>desc NOFICKCP</description>
                            <msb>14</msb>
                            <lsb>13</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CCONR3</name>
                    <description>desc CCONR3</description>
                    <addressOffset>0x108</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x7F71</resetMask>
                    <fields>
                        <field>
                            <name>CAPMD</name>
                            <description>desc CAPMD</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HICP0</name>
                            <description>desc HICP0</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HICP1</name>
                            <description>desc HICP1</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HICP2</name>
                            <description>desc HICP2</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HICP3</name>
                            <description>desc HICP3</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HICP4</name>
                            <description>desc HICP4</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HICP5</name>
                            <description>desc HICP5</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HICP6</name>
                            <description>desc HICP6</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NOFIENCP</name>
                            <description>desc NOFIENCP</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NOFICKCP</name>
                            <description>desc NOFICKCP</description>
                            <msb>14</msb>
                            <lsb>13</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CCONR4</name>
                    <description>desc CCONR4</description>
                    <addressOffset>0x10C</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x7F71</resetMask>
                    <fields>
                        <field>
                            <name>CAPMD</name>
                            <description>desc CAPMD</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HICP0</name>
                            <description>desc HICP0</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HICP1</name>
                            <description>desc HICP1</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HICP2</name>
                            <description>desc HICP2</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HICP3</name>
                            <description>desc HICP3</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HICP4</name>
                            <description>desc HICP4</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HICP5</name>
                            <description>desc HICP5</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HICP6</name>
                            <description>desc HICP6</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NOFIENCP</name>
                            <description>desc NOFIENCP</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NOFICKCP</name>
                            <description>desc NOFICKCP</description>
                            <msb>14</msb>
                            <lsb>13</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CCONR5</name>
                    <description>desc CCONR5</description>
                    <addressOffset>0x110</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x7F71</resetMask>
                    <fields>
                        <field>
                            <name>CAPMD</name>
                            <description>desc CAPMD</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HICP0</name>
                            <description>desc HICP0</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HICP1</name>
                            <description>desc HICP1</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HICP2</name>
                            <description>desc HICP2</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HICP3</name>
                            <description>desc HICP3</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HICP4</name>
                            <description>desc HICP4</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HICP5</name>
                            <description>desc HICP5</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HICP6</name>
                            <description>desc HICP6</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NOFIENCP</name>
                            <description>desc NOFIENCP</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NOFICKCP</name>
                            <description>desc NOFICKCP</description>
                            <msb>14</msb>
                            <lsb>13</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CCONR6</name>
                    <description>desc CCONR6</description>
                    <addressOffset>0x114</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x7F71</resetMask>
                    <fields>
                        <field>
                            <name>CAPMD</name>
                            <description>desc CAPMD</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HICP0</name>
                            <description>desc HICP0</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HICP1</name>
                            <description>desc HICP1</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HICP2</name>
                            <description>desc HICP2</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HICP3</name>
                            <description>desc HICP3</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HICP4</name>
                            <description>desc HICP4</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HICP5</name>
                            <description>desc HICP5</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HICP6</name>
                            <description>desc HICP6</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NOFIENCP</name>
                            <description>desc NOFIENCP</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NOFICKCP</name>
                            <description>desc NOFICKCP</description>
                            <msb>14</msb>
                            <lsb>13</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CCONR7</name>
                    <description>desc CCONR7</description>
                    <addressOffset>0x118</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x7F71</resetMask>
                    <fields>
                        <field>
                            <name>CAPMD</name>
                            <description>desc CAPMD</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HICP0</name>
                            <description>desc HICP0</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HICP1</name>
                            <description>desc HICP1</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HICP2</name>
                            <description>desc HICP2</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HICP3</name>
                            <description>desc HICP3</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HICP4</name>
                            <description>desc HICP4</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HICP5</name>
                            <description>desc HICP5</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HICP6</name>
                            <description>desc HICP6</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NOFIENCP</name>
                            <description>desc NOFIENCP</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NOFICKCP</name>
                            <description>desc NOFICKCP</description>
                            <msb>14</msb>
                            <lsb>13</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
