pyocd/pyOCD/pyocd/debug/svd/data/HC32K118.svd
                <register>
                    <name>CR3</name>
                    <description>desc CR3</description>
                    <addressOffset>0x14</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xDE003F18</resetMask>
                    <fields>
                        <field>
                            <name>HDSEL</name>
                            <description>desc HDSEL</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>LOOP</name>
                            <description>desc LOOP</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RTSE</name>
                            <description>desc RTSE</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CTSE</name>
                            <description>desc CTSE</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DED</name>
                            <description>desc DED</description>
                            <msb>13</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DEA</name>
                            <description>desc DEA</description>
                            <msb>28</msb>
                            <lsb>25</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DEM</name>
                            <description>desc DEM</description>
                            <msb>30</msb>
                            <lsb>30</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DEP</name>
                            <description>desc DEP</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PR</name>
                    <description>desc PR</description>
                    <addressOffset>0x18</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xF1F</resetMask>
                    <fields>
                        <field>
                            <name>PSC</name>
                            <description>desc PSC</description>
                            <msb>1</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>LBMPSC</name>
                            <description>desc LBMPSC</description>
                            <msb>3</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ULBREN</name>
                            <description>desc ULBREN</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RTOB</name>
                            <description>desc RTOB</description>
                            <msb>11</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>LBMC</name>
                    <description>desc LBMC</description>
                    <addressOffset>0x1C</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>LBMC</name>
                            <description>desc LBMC</description>
                            <msb>15</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
            </registers>
        </peripheral>
        <peripheral derivedFrom="USART3">
            <name>USART4</name>
            <description>desc USART</description>
            <baseAddress>0x40002400</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x20</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>USART4_WKUP_RXFULL_TXEMPT</name>
                <description>USART unit 4 weakup receive full trans buffer empty interrupt</description>
                <value>17</value>
            </interrupt>
            <interrupt>
                <name>USART4_ERR_TXEND_TXCMPL_RTO</name>
                <description>USART unit 2 error transmit end trans complete or receive timeout interrupt</description>
                <value>18</value>
            </interrupt>
        </peripheral>
    </peripherals>
</device>
